// sam zestaw tych wyrażeń regularnych pierwotnie pochodzi z
// facebooka Polish Cyryllic, o który ich poprosiłem
// był zapisany w c# w formie wielu funkcji, ale przerobiłem go najpierw
// na dictionary w pythonie używając wyrażeń regularnych,
// a następnie używając pakietu JSON przerobiłem to
// dictionary na plik .json, który internetowym
// konwerterem (o wiele mniej zachodu niż z JSON.parse) przerobiłem na
// ten objekt javascriptowy


var dict = {
  items: [
    {
      'ś([lL])([iI])': 's$1$2'
    },
    {
      'Ś([lL])([iI])': 'S$1$2'
    },
    {
      'ś([ńŃmM])': 's$1'
    },
    {
      'Ś([ńŃmM])': 'S$1'
    },
    {
      rz: 'рь'
    },
    {
      Rz: 'Рь'
    },
    {
      RZ: 'РЬ'
    },
    {
      'ś([ćw])': 's$1'
    },
    {
      'Ś([ćw])': 's$1'
    },
    {
      '(?:Ś([ĆW])|ś([ĆW]))': 'S$1'
    },
    {
      '([ŁłDdTt])i(\\S)': '$1j$2'
    },
    {
      '([ŁłDdTt])I(\\S)': '$1j$2'
    },
    {
      '([Rr])i': '$1і'
    },
    {
      '([Rr])I': '$1І'
    },
    {
      'ch|h': 'х'
    },
    {
      '[Cc][Hh]|H': 'Х'
    },
    {
      'ł': 'л'
    },
    {
      'Ł': 'Л'
    },
    {
      l: 'ль'
    },
    {
      '\\bL': 'Ль'
    },
    {
      L: 'ЛЬ'
    },
    {
      szcz: 'щ'
    },
    {
      '[Ss][Zz][Cc][Zz]': 'Щ'
    },
    {
      cz: 'ч'
    },
    {
      '[cC][Zz]': 'Ч'
    },
    {
      sz: 'ш'
    },
    {
      '[sS][zZ]': 'Ш'
    },
    {
      'dź': 'дь'
    },
    {
      '(?:Dź|dŹ)': 'Дь'
    },
    {
      'DŹ': 'ДЬ'
    },
    {
      'ć': 'ть'
    },
    {
      '\\bĆ': 'Ть'
    },
    {
      'Ć': 'ТЬ'
    },
    {
      'ś': 'сь'
    },
    {
      '\\bŚ': 'Сь'
    },
    {
      'Ś': 'СЬ'
    },
    {
      'ź': 'зь'
    },
    {
      '\\bŹ': 'Зь'
    },
    {
      'Ź': 'ЗЬ'
    },
    {
      'ń': 'нь'
    },
    {
      '\\bŃ': 'Нь'
    },
    {
      'Ń': 'НЬ'
    },
    {
      'ż': 'ж'
    },
    {
      'Ż': 'Ж'
    },
    {
      '(?:([лнсд])[ьЬ]|([ЛНСД])[ьЬ])y': '$1$2ѣ'
    },
    {
      '(?:([лнсд])[ьЬ]|([ЛНСД])[ьЬ])Y': '$1$2Ѣ'
    },
    {
      '([щЩчЧшШжЖ])y': '$1и'
    },
    {
      '([щЩчЧшШжЖ])Y': '$1И'
    },
    {
      '([dDsSnNzZtTłŁRr])j([eauąęoóEAUĄĘOÓ])': '$1ъj$2'
    },
    {
      '([dDsSnNzZtTłŁRr])J([eauąęoó])': '$1ъJ$2'
    },
    {
      '([dDsSnNzZtTłŁ])J([EAUĄĘOÓ])': '$1ЪJ$2'
    },
    {
      'dzi([eauąęoóEAUĄĘOÓ])': 'dj$1'
    },
    {
      '[Dd][Zz][Ii]([eauąęoóEAUĄĘOÓ])': 'Dj$1'
    },
    {
      'ci([eauąęoóEAUĄĘOÓ])': 'tj$1'
    },
    {
      '[Cc][Ii]([eauąęoóEAUĄĘOÓ])': 'Tj$1'
    },
    {
      'rz([eauąęoóEAUĄĘOÓyY])': 'rj$1'
    },
    {
      '[Rr][Zz]([eauąęoóEAUĄĘOÓyY])': 'Rj$1'
    },
    {
      '([nsz])i([eauąęoóEAUĄĘOÓ])': '$1j$2'
    },
    {
      '([NnSsZz])[Ii]([eauąęoóEAUĄĘOÓ])': '$1j$2'
    },
    {
      dzi: 'ди'
    },
    {
      '[Dd][Zz]i': 'Ди'
    },
    {
      '[Dd][Zz]I': 'ДИ'
    },
    {
      ci: 'ти'
    },
    {
      '[Cc]i': 'Ти'
    },
    {
      '[Cc]I': 'ТИ'
    },
    {
      '([шШщЩчЧжЖ])([eE])': '$1j$2'
    },
    {
      'i([aąeęoóuAĄEĘOÓU])': 'j$1'
    },
    {
      'I([aąeęoóuAĄEĘOÓU])': 'J$1'
    },
    {
      'і([aąeęoóuAĄEĘOÓU])': 'ъj$1'
    },
    {
      'І([aąeęoóuAĄEĘOÓU])': 'ЪJ$1'
    },
    {
      '[jь]a': 'я'
    },
    {
      '[jJьЬ][aA]': 'Я'
    },
    {
      '[jь]ą': 'ѭ'
    },
    {
      '[jJьЬ][ąĄ]': 'Ѭ'
    },
    {
      '[jь]e': 'е'
    },
    {
      '[jJьЬ][eE]': 'Е'
    },
    {
      '[jь]ę': 'ѩ'
    },
    {
      '[jJьЬ][ęĘ]': 'Ѩ'
    },
    {
      '[ij]i': 'ї'
    },
    {
      '[JjIi][Ii]': 'Ї'
    },
    {
      '\\B[jь]o': 'ё'
    },
    {
      '\\B[jJьЬ][oO]': 'Ё'
    },
    {
      '[jь]u': 'ю'
    },
    {
      '[jJьЬ][uU]': 'Ю'
    },
    {
      '(?:[jь]y|ьi)': 'и'
    },
    {
      '(?:[jJьЬ][yY]|[ьЬ][iI])': 'И'
    },
    {
      '([ШшЩщЧчЖж])i': '$1і'
    },
    {
      '([ШшЩщЧчЖж])I': '$1І'
    },
    {
      a: 'а'
    },
    {
      A: 'А'
    },
    {
      'ą': 'ѫ'
    },
    {
      'Ą': 'Ѫ'
    },
    {
      b: 'б'
    },
    {
      B: 'Б'
    },
    {
      c: 'ц'
    },
    {
      C: 'Ц'
    },
    {
      d: 'д'
    },
    {
      D: 'Д'
    },
    {
      e: 'э'
    },
    {
      E: 'Э'
    },
    {
      'ę': 'ѧ'
    },
    {
      'Ę': 'Ѧ'
    },
    {
      f: 'ф'
    },
    {
      F: 'Ф'
    },
    {
      g: 'г'
    },
    {
      G: 'Г'
    },
    {
      i: 'и'
    },
    {
      I: 'И'
    },
    {
      j: 'й'
    },
    {
      J: 'Й'
    },
    {
      '[kq]': 'к'
    },
    {
      '[KQ]': 'К'
    },
    {
      m: 'м'
    },
    {
      M: 'М'
    },
    {
      n: 'н'
    },
    {
      N: 'Н'
    },
    {
      o: 'о'
    },
    {
      O: 'О'
    },
    {
      'ó': 'о́'
    },
    {
      'Ó': 'О́'
    },
    {
      p: 'п'
    },
    {
      P: 'П'
    },
    {
      r: 'р'
    },
    {
      R: 'Р'
    },
    {
      s: 'с'
    },
    {
      S: 'С'
    },
    {
      t: 'т'
    },
    {
      T: 'Т'
    },
    {
      u: 'у'
    },
    {
      U: 'У'
    },
    {
      '[vw]': 'в'
    },
    {
      '[VW]': 'В'
    },
    {
      x: 'кс'
    },
    {
      '\\bX': 'Кс'
    },
    {
      X: 'КС'
    },
    {
      y: 'ы'
    },
    {
      Y: 'Ы'
    },
    {
      z: 'з'
    },
    {
      Z: 'З'
    },
    {
      'Цх': 'Х'
    },
    {
      '([тТ])й([^оО])': '$1і$2'
    },
    {
      '([тТ])Й([^оО])': '$1І$2'
    },
    {
      '([сС])[ьЬ]([лЛнНмМтТпП])([ьЬяЯѭѬиИеЕѩѨёЁюЮ])': '$1$2$3'
    },
    {
      '([дДлЛ])й': '$1і'
    },
    {
      '([дДлЛ])Й': '$1І'
    },
    {
      'іи': 'ї'
    },
    {
      '[іІ][иИ]': 'Ї'
    }
  ]
};
